Catalogs/АС_Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АС_Автомобили</Name>
			<Comment>Группы справочника — фирмы (производители), элементы — модели.</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АС_Синонимы</Name>
					<Comment>Варианты написания марки или модели, разделённые запятыми.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Контрагенты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АС_МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АС_МодельАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АС_МаркаАвтомобиляИзСправочника</Name>
					<Comment>Ссылка на группу-производителя справочника марок и моделей.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.АС_Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АС_МодельАвтомобиляИзСправочника</Name>
					<Comment>Ссылка на модель внутри выбранной группы-производителя.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.АС_Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АС_ГодАвтомобиля</Name>
					<Comment>Год выпуска автомобиля.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АС_ГосНомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АС_VINАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АС_Автомобили/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура АС_ИмпортироватьCSV(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	ФайловаяСистемаКлиент.ЗагрузитьФайл(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат.Количество() = 0
		Или НЕ ЗначениеЗаполнено(Результат.Хранение) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Итог = ИмпортироватьCSVНаСервере(Результат.Хранение);
		ОбщегоНазначенияКлиент.СообщитьПользователю(Итог);
		Оповестить("АС_АвтомобилиИзменены");
	Исключение
		ПоказатьПредупреждение(, "Не удалось импортировать CSV:" + Символы.ПС
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ИмпортироватьCSVНаСервере(Адрес)
	
	ДвоичныеДанныеCSV = ПолучитьИзВременногоХранилища(Адрес);
	ТекстCSV = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеCSV, КодировкаТекста.UTF8);
	
	Результат = Новый Структура;
	Результат.Вставить("ДобавленоФирм", 0);
	Результат.Вставить("ДобавленоМоделей", 0);
	Результат.Вставить("ОбъединеноФирм", 0);
	Результат.Вставить("ОбъединеноМоделей", 0);
	Результат.Вставить("ПеренесеноСсылок", 0);
	Результат.Вставить("ПропущеноСтрок", 0);
	
	ОбъединитьТочныеДубли(Результат);
	Фирмы = ПолучитьФирмыПоКлючу();
	Модели = ПолучитьМоделиПоКлючу();
	
	СтрокиCSV = СтрРазделить(ТекстCSV, Символы.ПС, Ложь);
	Для Каждого СтрокаCSV Из СтрокиCSV Цикл
			Если ПустаяСтрока(СокрЛП(СтрокаCSV)) Тогда
				Продолжить;
			КонецЕсли;
			
			ПоляCSV = РазобратьСтрокуCSV(СтрокаCSV);
			Если ПоляCSV.Количество() < 2 Тогда
				Результат.ПропущеноСтрок = Результат.ПропущеноСтрок + 1;
				Продолжить;
			КонецЕсли;
			
			ИмяФирмы = ОчиститьПолеCSV(ПоляCSV[0]);
			ИмяМодели = ОчиститьПолеCSV(ПоляCSV[1]);
			СинонимыФирмы = ?(ПоляCSV.Количество() >= 3, ОчиститьПолеCSV(ПоляCSV[2]), "");
			СинонимыМодели = ?(ПоляCSV.Количество() >= 4, ОчиститьПолеCSV(ПоляCSV[3]), "");
			Если ПустаяСтрока(ИмяФирмы) Или ПустаяСтрока(ИмяМодели) Тогда
				Результат.ПропущеноСтрок = Результат.ПропущеноСтрок + 1;
				Продолжить;
			КонецЕсли;
			
			КлючФирмы = КлючНаименования(ИмяФирмы);
			Фирма = Фирмы.Получить(КлючФирмы);
			Если Фирма = Неопределено Тогда
				ОбъектФирмы = Справочники.АС_Автомобили.СоздатьГруппу();
				ОбъектФирмы.Наименование = ИмяФирмы;
				ОбъектФирмы.АС_Синонимы = СинонимыФирмы;
				ОбъектФирмы.Записать();
				Фирма = ОбъектФирмы.Ссылка;
				Фирмы.Вставить(КлючФирмы, Фирма);
				Результат.ДобавленоФирм = Результат.ДобавленоФирм + 1;
			ИначеЕсли НЕ ПустаяСтрока(СинонимыФирмы) Тогда
				ОбъектФирмы = Фирма.ПолучитьОбъект();
				ОбъектФирмы.АС_Синонимы = ОбъединитьСинонимы(ОбъектФирмы.АС_Синонимы, СинонимыФирмы);
				ОбъектФирмы.Записать();
			КонецЕсли;
			
			КлючМодели = Строка(Фирма.УникальныйИдентификатор()) + "|" + КлючНаименования(ИмяМодели);
			Если Модели.Получить(КлючМодели) = Неопределено Тогда
				ОбъектМодели = Справочники.АС_Автомобили.СоздатьЭлемент();
				ОбъектМодели.Родитель = Фирма;
				ОбъектМодели.Наименование = ИмяМодели;
				ОбъектМодели.АС_Синонимы = СинонимыМодели;
				ОбъектМодели.Записать();
				Модели.Вставить(КлючМодели, ОбъектМодели.Ссылка);
				Результат.ДобавленоМоделей = Результат.ДобавленоМоделей + 1;
			ИначеЕсли НЕ ПустаяСтрока(СинонимыМодели) Тогда
				Модель = Модели.Получить(КлючМодели);
				ОбъектМодели = Модель.ПолучитьОбъект();
				ОбъектМодели.АС_Синонимы = ОбъединитьСинонимы(ОбъектМодели.АС_Синонимы, СинонимыМодели);
				ОбъектМодели.Записать();
			КонецЕсли;
	КонецЦикла;
	
	ОбъединитьТочныеДубли(Результат);
	Возврат СтрШаблон("Импорт завершён. Добавлено фирм: %1, моделей: %2. Объединено дублей фирм: %3, моделей: %4. Обновлено ссылок контрагентов: %5. Пропущено строк: %6.",
		Результат.ДобавленоФирм, Результат.ДобавленоМоделей,
		Результат.ОбъединеноФирм, Результат.ОбъединеноМоделей,
		Результат.ПеренесеноСсылок, Результат.ПропущеноСтрок);
	
КонецФункции

&НаСервере
Процедура ОбъединитьТочныеДубли(Результат)
	
	Фирмы = ПолучитьСсылкиАвтомобилей(Истина);
	КаноническиеФирмы = Новый Соответствие;
	Для Каждого Фирма Из Фирмы Цикл
		Ключ = КлючНаименования(Фирма.Наименование);
		КаноническаяФирма = КаноническиеФирмы.Получить(Ключ);
		Если КаноническаяФирма = Неопределено Тогда
			КаноническиеФирмы.Вставить(Ключ, Фирма.Ссылка);
		Иначе
			ОбъединитьФирмы(КаноническаяФирма, Фирма.Ссылка, Результат);
			Результат.ОбъединеноФирм = Результат.ОбъединеноФирм + 1;
		КонецЕсли;
	КонецЦикла;
	
	Фирмы = ПолучитьСсылкиАвтомобилей(Истина);
	Для Каждого Фирма Из Фирмы Цикл
		Модели = ПолучитьСсылкиАвтомобилей(Ложь, Фирма.Ссылка);
		КаноническиеМодели = Новый Соответствие;
		Для Каждого Модель Из Модели Цикл
			Ключ = КлючНаименования(Модель.Наименование);
			КаноническаяМодель = КаноническиеМодели.Получить(Ключ);
			Если КаноническаяМодель = Неопределено Тогда
				КаноническиеМодели.Вставить(Ключ, Модель.Ссылка);
			Иначе
				ОбъектКаноническойМодели = КаноническаяМодель.ПолучитьОбъект();
				ОбъектКаноническойМодели.АС_Синонимы = ОбъединитьСинонимы(ОбъектКаноническойМодели.АС_Синонимы, Модель.Ссылка.АС_Синонимы);
				ОбъектКаноническойМодели.Записать();
				ЗаменитьСсылкиКонтрагентов(, , Модель.Ссылка, КаноническаяМодель, Результат);
				Модель.Ссылка.ПолучитьОбъект().Удалить();
				Результат.ОбъединеноМоделей = Результат.ОбъединеноМоделей + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбъединитьФирмы(КаноническаяФирма, ДубльФирмы, Результат)
	
	ОбъектКаноническойФирмы = КаноническаяФирма.ПолучитьОбъект();
	ОбъектКаноническойФирмы.АС_Синонимы = ОбъединитьСинонимы(ОбъектКаноническойФирмы.АС_Синонимы, ДубльФирмы.АС_Синонимы);
	ОбъектКаноническойФирмы.Записать();
	
	КаноническиеМодели = Новый Соответствие;
	Для Каждого Модель Из ПолучитьСсылкиАвтомобилей(Ложь, КаноническаяФирма) Цикл
		КаноническиеМодели.Вставить(КлючНаименования(Модель.Наименование), Модель.Ссылка);
	КонецЦикла;
	
	Для Каждого Модель Из ПолучитьСсылкиАвтомобилей(Ложь, ДубльФирмы) Цикл
		Ключ = КлючНаименования(Модель.Наименование);
		КаноническаяМодель = КаноническиеМодели.Получить(Ключ);
		Если КаноническаяМодель = Неопределено Тогда
			ОбъектМодели = Модель.Ссылка.ПолучитьОбъект();
			ОбъектМодели.Родитель = КаноническаяФирма;
			ОбъектМодели.Записать();
			КаноническиеМодели.Вставить(Ключ, ОбъектМодели.Ссылка);
		Иначе
			ОбъектКаноническойМодели = КаноническаяМодель.ПолучитьОбъект();
			ОбъектКаноническойМодели.АС_Синонимы = ОбъединитьСинонимы(ОбъектКаноническойМодели.АС_Синонимы, Модель.Ссылка.АС_Синонимы);
			ОбъектКаноническойМодели.Записать();
			ЗаменитьСсылкиКонтрагентов(, , Модель.Ссылка, КаноническаяМодель, Результат);
			Модель.Ссылка.ПолучитьОбъект().Удалить();
			Результат.ОбъединеноМоделей = Результат.ОбъединеноМоделей + 1;
		КонецЕсли;
	КонецЦикла;
	
	ЗаменитьСсылкиКонтрагентов(ДубльФирмы, КаноническаяФирма, , , Результат);
	ДубльФирмы.ПолучитьОбъект().Удалить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаменитьСсылкиКонтрагентов(СтараяФирма, НоваяФирма, СтараяМодель, НоваяМодель, Результат)
	
	Запрос = Новый Запрос;
	Условия = Новый Массив;
	Если ЗначениеЗаполнено(СтараяФирма) Тогда
		Условия.Добавить("Контрагенты.АС_МаркаАвтомобиляИзСправочника = &СтараяФирма");
		Запрос.УстановитьПараметр("СтараяФирма", СтараяФирма);
	КонецЕсли;
	Если ЗначениеЗаполнено(СтараяМодель) Тогда
		Условия.Добавить("Контрагенты.АС_МодельАвтомобиляИзСправочника = &СтараяМодель");
		Запрос.УстановитьПараметр("СтараяМодель", СтараяМодель);
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ Контрагенты.Ссылка ИЗ Справочник.Контрагенты КАК Контрагенты ГДЕ "
		+ СтрСоединить(Условия, " ИЛИ ");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектКонтрагента = Выборка.Ссылка.ПолучитьОбъект();
		Если ЗначениеЗаполнено(СтараяФирма)
			И ОбъектКонтрагента.АС_МаркаАвтомобиляИзСправочника = СтараяФирма Тогда
			ОбъектКонтрагента.АС_МаркаАвтомобиляИзСправочника = НоваяФирма;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтараяМодель)
			И ОбъектКонтрагента.АС_МодельАвтомобиляИзСправочника = СтараяМодель Тогда
			ОбъектКонтрагента.АС_МодельАвтомобиляИзСправочника = НоваяМодель;
		КонецЕсли;
		ОбъектКонтрагента.Записать();
		Результат.ПеренесеноСсылок = Результат.ПеренесеноСсылок + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкиАвтомобилей(ЭтоГруппы, Родитель = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Ссылка, Наименование ИЗ Справочник.АС_Автомобили
		|ГДЕ ЭтоГруппа = &ЭтоГруппа";
	Запрос.УстановитьПараметр("ЭтоГруппа", ЭтоГруппы);
	Если Родитель <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + "И Родитель = &Родитель";
		Запрос.УстановитьПараметр("Родитель", Родитель);
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + Символы.ПС + "УПОРЯДОЧИТЬ ПО Предопределенный УБЫВ, Ссылка";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьФирмыПоКлючу()
	Результат = Новый Соответствие;
	Для Каждого Строка Из ПолучитьСсылкиАвтомобилей(Истина) Цикл
		Результат.Вставить(КлючНаименования(Строка.Наименование), Строка.Ссылка);
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьМоделиПоКлючу()
	Результат = Новый Соответствие;
	Для Каждого Фирма Из ПолучитьСсылкиАвтомобилей(Истина) Цикл
		Для Каждого Модель Из ПолучитьСсылкиАвтомобилей(Ложь, Фирма.Ссылка) Цикл
			Ключ = Строка(Фирма.Ссылка.УникальныйИдентификатор()) + "|" + КлючНаименования(Модель.Наименование);
			Результат.Вставить(Ключ, Модель.Ссылка);
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Функция КлючНаименования(Значение)
	Возврат ВРег(СокрЛП(СтрЗаменить(Строка(Значение), Символы.НПП, " ")));
КонецФункции

&НаСервере
Функция ОчиститьПолеCSV(Значение)
	Результат = СокрЛП(Значение);
	Если СтрНачинаетсяС(Результат, """") И СтрЗаканчиваетсяНа(Результат, """") Тогда
		Результат = Сред(Результат, 2, СтрДлина(Результат) - 2);
		Результат = СтрЗаменить(Результат, """""", """");
	КонецЕсли;
	Возврат СокрЛП(Результат);
КонецФункции

&НаСервере
Функция РазобратьСтрокуCSV(СтрокаCSV)
	Результат = Новый Массив;
	ТекущееПоле = "";
	ВКавычках = Ложь;
	Для НомерСимвола = 1 По СтрДлина(СтрокаCSV) Цикл
		Символ = Сред(СтрокаCSV, НомерСимвола, 1);
		Если Символ = """" Тогда
			Если ВКавычках И НомерСимвола < СтрДлина(СтрокаCSV)
				И Сред(СтрокаCSV, НомерСимвола + 1, 1) = """" Тогда
				ТекущееПоле = ТекущееПоле + """";
				НомерСимвола = НомерСимвола + 1;
			Иначе
				ВКавычках = НЕ ВКавычках;
			КонецЕсли;
		ИначеЕсли Символ = ";" И НЕ ВКавычках Тогда
			Результат.Добавить(ТекущееПоле);
			ТекущееПоле = "";
		Иначе
			ТекущееПоле = ТекущееПоле + Символ;
		КонецЕсли;
	КонецЦикла;
	Результат.Добавить(ТекущееПоле);
	Возврат Результат;
КонецФункции

&НаСервере
Функция ОбъединитьСинонимы(ТекущиеСинонимы, НовыеСинонимы)
	Результат = СокрЛП(Строка(ТекущиеСинонимы));
	Ключи = Новый Соответствие;
	Для Каждого Синоним Из СтрРазделить(Результат, ",", Ложь) Цикл
		Ключи.Вставить(КлючНаименования(Синоним), Истина);
	КонецЦикла;
	Для Каждого Синоним Из СтрРазделить(Строка(НовыеСинонимы), ",", Ложь) Цикл
		Синоним = СокрЛП(Синоним);
		Если НЕ ПустаяСтрока(Синоним) И Ключи.Получить(КлючНаименования(Синоним)) = Неопределено Тогда
			Результат = Результат + ?(ПустаяСтрока(Результат), "", ", ") + Синоним;
			Ключи.Вставить(КлючНаименования(Синоним), Истина);
		КонецЕсли;
	КонецЦикла;
	Возврат Лев(Результат, 500);
КонецФункции
